; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	image2 - mode
	infrared0 - mode
	spectrograph1 - mode
	spectrograph3 - mode
	thermograph4 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	GroundStation8 - direction
	Star7 - direction
	Star5 - direction
	Star11 - direction
	Star0 - direction
	Star2 - direction
	Star6 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image2)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation10)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument1 thermograph4)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 GroundStation10)
	(supports instrument2 spectrograph3)
	(supports instrument2 image2)
	(calibration_target instrument2 Star5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
	(supports instrument3 infrared0)
	(supports instrument3 image2)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 Star11)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon12)
)
(:goal (and
	(pointing satellite1 Star7)
	(pointing satellite2 Star2)
	(have_image Phenomenon12 spectrograph3)
	(have_image Phenomenon13 spectrograph1)
	(have_image Phenomenon14 spectrograph1)
	(have_image Planet15 infrared0)
	(have_image Phenomenon16 image2)
))

)

; plan
1. (turn_to satellite2 star2 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star2)
   goals met: 1 of 7
2. (turn_to satellite1 groundstation10 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 groundstation10)
   goals met: 1 of 7
3. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 7
4. (calibrate satellite1 instrument1 groundstation10)
   added: (calibrated instrument1)
   goals met: 1 of 7
5. (turn_to satellite1 phenomenon13 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 7
6. (turn_to satellite0 groundstation10 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation10)
   goals met: 1 of 7
7. (take_image satellite1 phenomenon13 instrument1 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 2 of 7
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 7
9. (calibrate satellite0 instrument0 groundstation10)
   added: (calibrated instrument0)
   goals met: 2 of 7
10. (turn_to satellite0 phenomenon12 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 7
11. (take_image satellite0 phenomenon12 instrument0 spectrograph3)
   added: (have_image phenomenon12 spectrograph3)
   goals met: 3 of 7
12. (turn_to satellite0 phenomenon16 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon16)
   goals met: 3 of 7
13. (take_image satellite0 phenomenon16 instrument0 image2)
   added: (have_image phenomenon16 image2)
   goals met: 4 of 7
14. (turn_to satellite0 planet15 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet15)
   goals met: 4 of 7
15. (take_image satellite0 planet15 instrument0 infrared0)
   added: (have_image planet15 infrared0)
   goals met: 5 of 7
16. (turn_to satellite1 phenomenon14 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon14)
   goals met: 5 of 7
17. (take_image satellite1 phenomenon14 instrument1 spectrograph1)
   added: (have_image phenomenon14 spectrograph1)
   goals met: 6 of 7
18. (turn_to satellite1 star7 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 star7)
   goals met: 7 of 7
